---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetProperty
source: html/7be89499-d011-ab43-4715-0ee6f9335970.htm
---
# Autodesk.Revit.DB.Visual.AssetProperty

Represents a property of material.

## Syntax (C#)
```csharp
public class AssetProperty : IDisposable
```

## Remarks
AssetProperty is the base class or all other AssetProperty sub classes.